[
    {
        "title": "Chemistry | Definition, Topics, Types, History, & Facts | Britannica",
        "link": "https:\/\/www.britannica.com\/science\/chemistry",
        "description": "The days are long past when one person could hope to have a detailed knowledge of all areas of chemistry. Those pursuing their interests into specific areas of chemistry … See more"
    },
    {
        "title": "Chemistry - Wikipedia",
        "link": "https:\/\/en.wikipedia.org\/wiki\/Chemistry",
        "description": "Chemistry is the scientific study of the properties and behavior of matter. It is a physical science within the natural sciences that studies the chemical elements that make up matter and compounds made of atoms, molecules and ions: their composition, structure, properties, behavior and the changes they undergo during reactions with other substances. Chemistry also addresses the nature of chemical bonds in chemical compounds."
    },
    {
        "title": "What is chemistry? - Live Science",
        "link": "https:\/\/www.livescience.com\/45986-what-is-chemistry.html",
        "description": "Nov 5, 2021 · Chemistry is the study of matter and its changes, and involves everything around us. Learn about the basics, branches and applications of chemistry, and how chemists work in …"
    },
    {
        "title": "What is Chemistry – Definition, Types, Methods - Research Method",
        "link": "https:\/\/researchmethod.net\/what-is-chemistry\/",
        "description": "Mar 25, 2024 · Learn what chemistry is, how it bridges physics, biology, and other natural sciences, and what are its types and methods. Explore the applications and challenges of …"
    },
    {
        "title": "Chemistry | College of Arts & Sciences",
        "link": "https:\/\/artsandsciences.louisville.edu\/academics-programs\/academic-departments\/chemistry",
        "description": "Chemistry is the fascinating study of matter — its properties, the reasons behind the combination or separation of substances and how these interactions involve energy."
    },
    {
        "title": "Portal:Chemistry - Wikipedia",
        "link": "https:\/\/en.wikipedia.org\/wiki\/Portal:Chemistry",
        "description": "Learn about the scientific study of matter, its properties and behavior, and the various fields and applications of chemistry. Explore the history, philosophy, resources, and images of chemistry …"
    },
    {
        "title": "What's Chemistry | Definition, Branch, History - Scienly",
        "link": "https:\/\/scienly.com\/chemistry\/",
        "description": "Apr 23, 2024 · Chemistry is all about matter’s physical and chemical properties, its chemical composition (i.e. structure), its physical and chemical changes which it undergoes and the …"
    }
]