[
    {
        "title": "Harry Potter | Official home of Harry Potter, Hogwarts Sorting, …",
        "link": "https:\/\/www.harrypotter.com\/",
        "description": "HarryPotter.com is the official home of Harry Potter, Fantastic Beasts, and the Wizarding World, formerly known as Pottermore. Brought to you by Wizarding World Digital and its parent …"
    },
    {
        "title": "Harry Potter - Wikipedia",
        "link": "https:\/\/en.wikipedia.org\/wiki\/Harry_Potter",
        "description": "Harry Potter is a series of seven fantasy novels written by British author J. K. Rowling. The novels chronicle the lives of a young wizard, Harry Potter, and his friends, Ron Weasley and Hermione Granger, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's conflict with Lord Voldemort, a dark wizard who intends to become imm…"
    },
    {
        "title": "The Harry Potter Movies in Chronological Order by Date of Release",
        "link": "https:\/\/www.imdb.com\/list\/ls000671664\/",
        "description": "List your movie, TV & celebrity picks. 1. Harry Potter and the Sorcerer's Stone. An orphaned boy enrolls in a school of wizardry, where he learns the truth about himself, his family and the …"
    },
    {
        "title": "Every Harry Potter Universe movie in order — What to watch first",
        "link": "https:\/\/www.soapcentral.com\/entertainment\/every-harry-potter-universe-movie-order-what-watch-first",
        "description": "2 days ago · Every Harry Potter Universe movie in order 1) Harry Potter and the Sorcerer’s Stone (2001) Harry Potter’s story starts when he finds out he is a wizard and heads to Hogwarts for the first time. It is here he meets Ron, Hermione, Hagrid, and the rest of the crew. It is all magic classes, …"
    },
    {
        "title": "'Harry Potter' HBO show: See first look at Harry, Nick Frost's Hagrid",
        "link": "https:\/\/www.usatoday.com\/story\/entertainment\/tv\/2025\/07\/14\/harry-potter-hbo-series-photo-cast-release-date\/85193182007\/",
        "description": "Jul 14, 2025 · HBO's \"Harry Potter\" television series is fleshing out its cast as production officially begins."
    }
]